Revit 2015 API
ViewDrafting.Create Method
 Creates a new ViewDrafting in the model.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Since: 2015
Syntax
C#
public static ViewDrafting Create(
	Document document,
	ElementId viewFamilyTypeId
)
Visual Basic
Public Shared Function Create ( _
	document As Document, _
	viewFamilyTypeId As ElementId _
) As ViewDrafting
Visual C++
public:
static ViewDrafting^ Create(
	Document^ document,
	ElementId^ viewFamilyTypeId
)
Parameters
document
Type: Autodesk.Revit.DB.Document
 The document in which the new drafting view will be created.
viewFamilyTypeId
Type: Autodesk.Revit.DB.ElementId
 The id of the ViewFamilyType that should be assigned to the new drafting view.
Return Value
 The newly created drafting view.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  viewFamilyTypeId is not a valid ViewFamilyType for a drafting view.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was NULL
See Also
ViewDrafting Class
Autodesk.Revit.DB Namespace